# Seconda lezione

In [2]:
# This cell loads some html style files (it may be run/ignored/deleted)
from IPython.core.display import HTML
with open( 'style/custom.css', 'r' ) as f: html_style = f.read()
HTML( html_style )

Leggiamo la stessa tabella della lezione scorsa:

In [18]:
import pandas as pd
df = pd.read_csv('../dati/Cork_Airport.csv', 
                 skiprows=24,
                )
df.tail(2) # questo solo per controllo

,date,ind,maxtp,ind.1,mintp,igmin,gmin,ind.2,rain,cbl,...,ind.5,hg,sun,dos,soil,pe,evap,smd_wd,smd_md,smd_pd
20848,30-jan-2019,0,3.4,1,-2.1,1,-2.0,0,1.6,976.5,...,0,13,3.9,3,2.600,0.3,0.4,0.0,-1.3,-10.0
20849,31-jan-2019,0,6.4,0,1.3,1,-8.8,0,15.0,965.3,...,0,31,2.2,0,3.300,0.6,0.8,0.0,-10.0,-10.0

Eliminiamo le colonne che non ci interessano:

In [19]:
df = df[ ['date', 'maxtp', 'mintp'] ]
df.head(2) # questo solo per controllo

          date  maxtp  mintp
0  01-jan-1962    2.8   -2.5
1  02-jan-1962    2.8   -3.7

## Filtrare righe di un dataframe

Osserviamo prima che alcune espressioni danno come risultato i valori booleani `True` e `False`

In [20]:
28 > 28

False

In [21]:
28 >= 28

True

In [22]:
28 == 28

True

La stessa cosa succede se confronto due variabili numeriche.

In [23]:
x1 = 28
x2 = 29
x2 <= x1

False

Queste operazioni posso essere vettorializzate, come nei seguenti esempi:

In [24]:
maxtp_maggiore_di_5 = df['maxtp'] > 5
maxtp_maggiore_di_5.head()

0    False
1    False
2    False
3     True
4     True
Name: maxtp, dtype: bool

Un vettore boolean può essere usato per filtrare determinate righe di un dataframe. Nel seguente esempio filtriamo i gioni in cui la temperatura massima è (strttamemte) superiore a 28°C.

`df[maxtp_maggiore_di_5]`

Tra vettori a valori Booliani (vero o falso) possiamo fare le seguenti operazioni

`&` congiunzione (un **e**)

`|` disgiunzione (un **o** non esclusivo)

`~` negazione

Per esempio nella seguente cella isoliamo le date in cui le massime sono state superiori a 28°C o le minime sono state inferiori a -8°C.

In [25]:
maxtp_maggiore_di_28 = df['maxtp'] > 28
mintp_minore_di_neg8 = df['mintp'] < -8
df[ maxtp_maggiore_di_28 | mintp_minore_di_neg8 ]

              date  maxtp  mintp
2604   17-feb-1969    2.3   -8.6
6209   01-jan-1979   -0.4   -8.5
7863   13-jul-1983   28.4   16.9
7864   14-jul-1983   28.7   19.0
10059  17-jul-1989   28.1   15.0

Un altro metodo per ottenere lo stesso risultato usa la funzione `map()`.  (È più prolisso ma anche più flessibile).

In [30]:
maxtp_maggiore_di_28 = df['maxtp'].map(lambda x: x > 28)
mintp_minore_di_neg8 = df['mintp'].map(lambda x: x < -8)
df[ maxtp_maggiore_di_28 | mintp_minore_di_neg8 ]

              date  maxtp  mintp
2604   17-feb-1969    2.3   -8.6
6209   01-jan-1979   -0.4   -8.5
7863   13-jul-1983   28.4   16.9
7864   14-jul-1983   28.7   19.0
10059  17-jul-1989   28.1   15.0

Col metodo `query()` si ottiene la stessa cosa in modo molto conciso, ma la sintassi è in qualche caso oscura. Si noti che qui dobbiamo usare `or`, `and` e `not` come operatori booleani.

In [31]:
df.query('mintp < -8 or maxtp > 28')

              date  maxtp  mintp
2604   17-feb-1969    2.3   -8.6
6209   01-jan-1979   -0.4   -8.5
7863   13-jul-1983   28.4   16.9
7864   14-jul-1983   28.7   19.0
10059  17-jul-1989   28.1   15.0

Se nel caso precedente vogliamo sostituire -8 e 28 con delle variabili, il codice è un po involuto:

In [32]:
t1 = -8
t2 = 28
df.query('mintp < @t1 or maxtp > @t2')

              date  maxtp  mintp
2604   17-feb-1969    2.3   -8.6
6209   01-jan-1979   -0.4   -8.5
7863   13-jul-1983   28.4   16.9
7864   14-jul-1983   28.7   19.0
10059  17-jul-1989   28.1   15.0